{
  "conteudo": [
    {
      "titulo": "Importando e Exibindo Dados JSON em JavaScript",
      "paragrafos": [
        "A integração de dados JSON em páginas da web é uma tarefa comum para desenvolvedores front-end. Neste código JavaScript, exploraremos como importar dados de um arquivo JSON remoto e exibi-los dinamicamente em uma página HTML. O código utiliza funções assíncronas e manipulação do DOM para criar uma experiência de usuário interativa."
      ]
    },
    {
      "titulo": "Carregando o JSON",
      "paragrafos": [
        "O ponto de partida do código é a definição da URL do JSON, localizado em um repositório GitHub. A função carregarConteudo é responsável por buscar e processar esses dados. A utilização do fetch e await permite a execução assíncrona, garantindo a eficiência do carregamento."
      ],
      "codigo": [
        "// Código 1: Definição da URL do JSON",
        "const jsonURL = 'https://raw.githubusercontent.com/brunomoraesdigital/ressources/main/Importando-dados-json-para-JavaScript.json';",
        "",
        "// Código 2: Função assíncrona para carregar e processar o JSON",
        "async function carregarConteudo() {",
        "  try {",
        "    const resposta = await fetch(jsonURL);",
        "    const data = await resposta.json();",
        "    // ..."
      ]
    },
    {
      "titulo": "Exibindo o Conteúdo na Página",
      "paragrafos": [
        "A função exibirConteudo é acionada após o carregamento bem-sucedido do JSON. Ela percorre os itens do JSON, cria elementos HTML dinamicamente para os títulos e parágrafos e os adiciona ao contêiner específico na página."
      ],
      "codigo": [
        "// Código 3: Função para exibir o conteúdo na página",
        "function exibirConteudo(conteudo) {",
        "  const container = document.getElementById('conteudo-container');",
        "",
        "  conteudo.forEach(item => {",
        "    // Código 4: Criando e adicionando título ao contêiner",
        "    const tituloElemento = document.createElement('h2');",
        "    tituloElemento.textContent = item.titulo;",
        "    container.appendChild(tituloElemento);",
        "",
        "    // Código 5: Iterando sobre os parágrafos e adicionando-os ao contêiner",
        "    item.paragrafos.forEach(paragrafo => {",
        "      const paragrafoElemento = document.createElement('p');",
        "      paragrafoElemento.textContent = paragrafo;",
        "      container.appendChild(paragrafoElemento);",
        "    });",
        "  });",
        "}"
      ]
    },
    {
      "titulo": "Conclusão",
      "paragrafos": [
        "Em resumo, este código exemplifica como importar dados externos em formato JSON para uma página web e apresentá-los de maneira estruturada. A utilização de funções assíncronas e manipulação do DOM possibilita uma integração suave e eficiente, enriquecendo a experiência do usuário ao exibir conteúdo dinâmico."
      ]
    }
  ]
}
